sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/devices/S32K146/startup/armc/startup_S32K146.S
                CPSID   I               ; Mask interrupts
#ifdef START_FROM_FLASH    
                ; Init ECC RAM
                LDR     R1, =__RAM_START
                LDR     R1, [R1]
                LDR     R2, =__RAM_END
                LDR     R2, [R2]
                SUBS    R2, R1
                SUBS    R2, #1
                BLE LC5
            
                MOVS    R0, #0
                MOVS    R3, #4
LC4
                STR R0, [R1]
                ADD	R1, R1, R3
                SUBS R2, #4
                BGE LC4
LC5
                NOP
#endif                
                LDR     R0, =0xE000ED08
                LDR     R1, =__VECTOR_TABLE
                STR     R1, [R0]
                LDR     R2, [R1]
                MSR     MSP, R2
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =init_data_bss
                BLX     R0
                CPSIE   i               ; Unmask interrupts
                LDR     R0, =__main
                BLX      R0
                ENDP

NMI_Handler\
                PROC
                EXPORT  NMI_Handler         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler         [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler         [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler         [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler         [WEAK]
                B       .
                ENDP
DefaultISR\
                PROC
                EXPORT  DefaultISR         [WEAK]
                B       .
                ENDP
Default_Handler PROC
                EXPORT    DMA0_IRQHandler 							 [WEAK]
                EXPORT    DMA1_IRQHandler 							 [WEAK]
                EXPORT    DMA2_IRQHandler 							 [WEAK]
                EXPORT    DMA3_IRQHandler 							 [WEAK]
                EXPORT    DMA4_IRQHandler 							 [WEAK]
                EXPORT    DMA5_IRQHandler 							 [WEAK]
                EXPORT    DMA6_IRQHandler 							 [WEAK]
                EXPORT    DMA7_IRQHandler 							 [WEAK]
                EXPORT    DMA8_IRQHandler 							 [WEAK]
                EXPORT    DMA9_IRQHandler 							 [WEAK]
                EXPORT    DMA10_IRQHandler 							 [WEAK]
                EXPORT    DMA11_IRQHandler 							 [WEAK]
                EXPORT    DMA12_IRQHandler 							 [WEAK]
                EXPORT    DMA13_IRQHandler 							 [WEAK]
                EXPORT    DMA14_IRQHandler 							 [WEAK]
                EXPORT    DMA15_IRQHandler 							 [WEAK]
                EXPORT    DMA_Error_IRQHandler 							 [WEAK]
                EXPORT    MCM_IRQHandler 							 [WEAK]
                EXPORT    FTFC_IRQHandler 							 [WEAK]
                EXPORT    Read_Collision_IRQHandler 							 [WEAK]
                EXPORT    LVD_LVW_IRQHandler 							 [WEAK]
                EXPORT    FTFC_Fault_IRQHandler 							 [WEAK]
                EXPORT    WDOG_EWM_IRQHandler 							 [WEAK]
                EXPORT    RCM_IRQHandler 							 [WEAK]
                EXPORT    LPI2C0_Master_IRQHandler 							 [WEAK]
                EXPORT    LPI2C0_Slave_IRQHandler 							 [WEAK]
                EXPORT    LPSPI0_IRQHandler 							 [WEAK]
                EXPORT    LPSPI1_IRQHandler 							 [WEAK]
                EXPORT    LPSPI2_IRQHandler 							 [WEAK]
                EXPORT    Reserved45_IRQHandler 							 [WEAK]
                EXPORT    Reserved46_IRQHandler 							 [WEAK]
                EXPORT    LPUART0_RxTx_IRQHandler 							 [WEAK]
                EXPORT    Reserved48_IRQHandler 							 [WEAK]
                EXPORT    LPUART1_RxTx_IRQHandler 							 [WEAK]
                EXPORT    Reserved50_IRQHandler 							 [WEAK]
                EXPORT    LPUART2_RxTx_IRQHandler 							 [WEAK]
                EXPORT    Reserved52_IRQHandler 							 [WEAK]
                EXPORT    Reserved53_IRQHandler 							 [WEAK]
                EXPORT    Reserved54_IRQHandler 							 [WEAK]
                EXPORT    ADC0_IRQHandler 							 [WEAK]
                EXPORT    ADC1_IRQHandler 							 [WEAK]
                EXPORT    CMP0_IRQHandler 							 [WEAK]
                EXPORT    Reserved58_IRQHandler 							 [WEAK]
                EXPORT    Reserved59_IRQHandler 							 [WEAK]
                EXPORT    ERM_single_fault_IRQHandler 							 [WEAK]
                EXPORT    ERM_double_fault_IRQHandler 							 [WEAK]
                EXPORT    RTC_IRQHandler 							 [WEAK]
                EXPORT    RTC_Seconds_IRQHandler 							 [WEAK]
                EXPORT    LPIT0_Ch0_IRQHandler 							 [WEAK]
                EXPORT    LPIT0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    LPIT0_Ch2_IRQHandler 							 [WEAK]
                EXPORT    LPIT0_Ch3_IRQHandler 							 [WEAK]
                EXPORT    PDB0_IRQHandler 							 [WEAK]
                EXPORT    Reserved69_IRQHandler 							 [WEAK]
                EXPORT    Reserved70_IRQHandler 							 [WEAK]
                EXPORT    Reserved71_IRQHandler 							 [WEAK]
                EXPORT    Reserved72_IRQHandler 							 [WEAK]
                EXPORT    SCG_IRQHandler 							 [WEAK]
                EXPORT    LPTMR0_IRQHandler 							 [WEAK]
                EXPORT    PORTA_IRQHandler 							 [WEAK]
                EXPORT    PORTB_IRQHandler 							 [WEAK]
                EXPORT    PORTC_IRQHandler 							 [WEAK]
                EXPORT    PORTD_IRQHandler 							 [WEAK]
                EXPORT    PORTE_IRQHandler 							 [WEAK]
                EXPORT    SWI_IRQHandler 							 [WEAK]
                EXPORT    Reserved81_IRQHandler 							 [WEAK]
                EXPORT    Reserved82_IRQHandler 							 [WEAK]
                EXPORT    Reserved83_IRQHandler 							 [WEAK]
                EXPORT    PDB1_IRQHandler 							 [WEAK]
                EXPORT    FLEXIO_IRQHandler 							 [WEAK]
                EXPORT    Reserved86_IRQHandler 							 [WEAK]
                EXPORT    Reserved87_IRQHandler 							 [WEAK]
                EXPORT    Reserved88_IRQHandler 							 [WEAK]
                EXPORT    Reserved89_IRQHandler 							 [WEAK]
                EXPORT    Reserved90_IRQHandler 							 [WEAK]
                EXPORT    Reserved91_IRQHandler 							 [WEAK]
                EXPORT    Reserved92_IRQHandler 							 [WEAK]
                EXPORT    Reserved93_IRQHandler 							 [WEAK]
                EXPORT    CAN0_ORed_IRQHandler 							 [WEAK]
                EXPORT    CAN0_Error_IRQHandler 							 [WEAK]
                EXPORT    CAN0_Wake_Up_IRQHandler 							 [WEAK]
                EXPORT    CAN0_ORed_0_15_MB_IRQHandler 							 [WEAK]
                EXPORT    CAN0_ORed_16_31_MB_IRQHandler 							 [WEAK]
                EXPORT    Reserved99_IRQHandler 							 [WEAK]
                EXPORT    Reserved100_IRQHandler 							 [WEAK]
                EXPORT    CAN1_ORed_IRQHandler 							 [WEAK]
                EXPORT    CAN1_Error_IRQHandler 							 [WEAK]
                EXPORT    Reserved103_IRQHandler 							 [WEAK]
                EXPORT    CAN1_ORed_0_15_MB_IRQHandler 							 [WEAK]
                EXPORT    CAN1_ORed_16_31_MB_IRQHandler 							 [WEAK]
                EXPORT    Reserved106_IRQHandler 							 [WEAK]
                EXPORT    Reserved107_IRQHandler 							 [WEAK]
                EXPORT    CAN2_ORed_IRQHandler 							 [WEAK]
                EXPORT    CAN2_Error_IRQHandler 							 [WEAK]
                EXPORT    Reserved110_IRQHandler 							 [WEAK]
                EXPORT    CAN2_ORed_0_15_MB_IRQHandler 							 [WEAK]
                EXPORT    Reserved112_IRQHandler 							 [WEAK]
                EXPORT    Reserved113_IRQHandler 							 [WEAK]
                EXPORT    Reserved114_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM0_Ovf_Reload_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM1_Ovf_Reload_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM2_Ovf_Reload_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM3_Ovf_Reload_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM4_Ovf_Reload_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Ch0_Ch1_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Ch2_Ch3_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Ch4_Ch5_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Ch6_Ch7_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Fault_IRQHandler 							 [WEAK]
                EXPORT    FTM5_Ovf_Reload_IRQHandler 							 [WEAK]
DMA0_IRQHandler
DMA1_IRQHandler
DMA2_IRQHandler
DMA3_IRQHandler
DMA4_IRQHandler
DMA5_IRQHandler
DMA6_IRQHandler
DMA7_IRQHandler
DMA8_IRQHandler
DMA9_IRQHandler
DMA10_IRQHandler
DMA11_IRQHandler
DMA12_IRQHandler
DMA13_IRQHandler
DMA14_IRQHandler
DMA15_IRQHandler
DMA_Error_IRQHandler
MCM_IRQHandler
FTFC_IRQHandler
Read_Collision_IRQHandler
LVD_LVW_IRQHandler
FTFC_Fault_IRQHandler
WDOG_EWM_IRQHandler
RCM_IRQHandler
LPI2C0_Master_IRQHandler
LPI2C0_Slave_IRQHandler
LPSPI0_IRQHandler
LPSPI1_IRQHandler
LPSPI2_IRQHandler
Reserved45_IRQHandler
Reserved46_IRQHandler
LPUART0_RxTx_IRQHandler
Reserved48_IRQHandler
LPUART1_RxTx_IRQHandler
Reserved50_IRQHandler
LPUART2_RxTx_IRQHandler
Reserved52_IRQHandler
Reserved53_IRQHandler
Reserved54_IRQHandler
ADC0_IRQHandler
ADC1_IRQHandler
CMP0_IRQHandler
Reserved58_IRQHandler
Reserved59_IRQHandler
ERM_single_fault_IRQHandler
ERM_double_fault_IRQHandler
RTC_IRQHandler
RTC_Seconds_IRQHandler
LPIT0_Ch0_IRQHandler
LPIT0_Ch1_IRQHandler
LPIT0_Ch2_IRQHandler
LPIT0_Ch3_IRQHandler
PDB0_IRQHandler
Reserved69_IRQHandler
Reserved70_IRQHandler
Reserved71_IRQHandler
Reserved72_IRQHandler
SCG_IRQHandler
LPTMR0_IRQHandler
PORTA_IRQHandler
PORTB_IRQHandler
PORTC_IRQHandler
PORTD_IRQHandler
PORTE_IRQHandler
SWI_IRQHandler
Reserved81_IRQHandler
Reserved82_IRQHandler
Reserved83_IRQHandler
PDB1_IRQHandler
FLEXIO_IRQHandler
Reserved86_IRQHandler
Reserved87_IRQHandler
Reserved88_IRQHandler
Reserved89_IRQHandler
Reserved90_IRQHandler
Reserved91_IRQHandler
Reserved92_IRQHandler
Reserved93_IRQHandler
CAN0_ORed_IRQHandler
CAN0_Error_IRQHandler
CAN0_Wake_Up_IRQHandler
CAN0_ORed_0_15_MB_IRQHandler
CAN0_ORed_16_31_MB_IRQHandler
Reserved99_IRQHandler
Reserved100_IRQHandler
CAN1_ORed_IRQHandler
CAN1_Error_IRQHandler
Reserved103_IRQHandler
CAN1_ORed_0_15_MB_IRQHandler
CAN1_ORed_16_31_MB_IRQHandler
Reserved106_IRQHandler
Reserved107_IRQHandler
CAN2_ORed_IRQHandler
CAN2_Error_IRQHandler
Reserved110_IRQHandler
CAN2_ORed_0_15_MB_IRQHandler
Reserved112_IRQHandler
Reserved113_IRQHandler
Reserved114_IRQHandler
FTM0_Ch0_Ch1_IRQHandler
FTM0_Ch2_Ch3_IRQHandler
FTM0_Ch4_Ch5_IRQHandler
FTM0_Ch6_Ch7_IRQHandler
FTM0_Fault_IRQHandler
FTM0_Ovf_Reload_IRQHandler
FTM1_Ch0_Ch1_IRQHandler
FTM1_Ch2_Ch3_IRQHandler
FTM1_Ch4_Ch5_IRQHandler
FTM1_Ch6_Ch7_IRQHandler
FTM1_Fault_IRQHandler
FTM1_Ovf_Reload_IRQHandler
FTM2_Ch0_Ch1_IRQHandler
FTM2_Ch2_Ch3_IRQHandler
FTM2_Ch4_Ch5_IRQHandler
FTM2_Ch6_Ch7_IRQHandler
FTM2_Fault_IRQHandler
FTM2_Ovf_Reload_IRQHandler
FTM3_Ch0_Ch1_IRQHandler
FTM3_Ch2_Ch3_IRQHandler
FTM3_Ch4_Ch5_IRQHandler
FTM3_Ch6_Ch7_IRQHandler
FTM3_Fault_IRQHandler
FTM3_Ovf_Reload_IRQHandler
FTM4_Ch0_Ch1_IRQHandler
FTM4_Ch2_Ch3_IRQHandler
FTM4_Ch4_Ch5_IRQHandler
FTM4_Ch6_Ch7_IRQHandler
FTM4_Fault_IRQHandler
FTM4_Ovf_Reload_IRQHandler
FTM5_Ch0_Ch1_IRQHandler
FTM5_Ch2_Ch3_IRQHandler
FTM5_Ch4_Ch5_IRQHandler
FTM5_Ch6_Ch7_IRQHandler
FTM5_Fault_IRQHandler
FTM5_Ovf_Reload_IRQHandler

                B       .

                ENDP

                ALIGN
                END
